# VertexIndexPairArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexIndexPairArrayIterator Class
Members See Also
---
An iterator to an array of VertexIndex pairs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class VertexIndexPairArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class VertexIndexPairArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class VertexIndexPairArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..VertexIndexPairArrayIterator
# See Also
VertexIndexPairArrayIterator Members
Autodesk.Revit.DB Namespace